{"file": 0, "data": 1, "raw": 2, "vllm": 3, "10": 4, "setup": 5, "py": 6, "type": 7, "function": 8, "symbol": 9, "load_module_from_path": 10, "calls": 11, "spec_from_file_location": 12, "module_from_spec": 13, "exec_module": 14, "def": 15, "module_name": 16, "path": 17, "spec": 18, "importlib": 19, "util": 20, "module": 21, "sys": 22, "modules": 23, "loader": 24, "return": 25, "is_sccache_available": 26, "which": 27, "bool": 28, "int": 29, "getenv": 30, "sccache": 31, "none": 32, "os": 33, "vllm_disable_sccache": 34, "is_ccache_available": 35, "ccache": 36, "is_ninja_available": 37, "ninja": 38, "is_url_available": 39, "urlopen": 40, "url": 41, "str": 42, "from": 43, "urllib": 44, "request": 45, "import": 46, "status": 47, "try": 48, "except": 49, "exception": 50, "false": 51, "200": 52, "class": 53, "cmakeextension": 54, "summary": 55, "__init__": 56, "method": 57, "parent": 58, "abspath": 59, "super": 60, "self": 61, "name": 62, "cmake_lists_dir": 63, "kwa": 64, "sources": 65, "py_limited_api": 66, "true": 67, "cmake_build_ext": 68, "compute_num_jobs": 69, "configure": 70, "build_extensions": 71, "run": 72, "info": 73, "_is_cuda": 74, "max": 75, "len": 76, "get_nvcc_cuda_version": 77, "version": 78, "sched_getaffinity": 79, "cpu_count": 80, "num_jobs": 81, "either": 82, "value": 83, "max_jobs": 84, "environment": 85, "variable": 86, "defined": 87, "number": 88, "cpus": 89, "available": 90, "envs": 91, "logger": 92, "using": 93, "jobs": 94, "else": 95, "isn": 96, "universally": 97, "so": 98, "fall": 99, "back": 100, "we": 101, "get": 102, "error": 103, "here": 104, "attributeerror": 105, "nvcc_threads": 106, "11": 107, "when": 108, "set": 109, "reduce": 110, "avoid": 111, "overloading": 112, "system": 113, "nvcc": 114, "threads": 115, "join": 116, "check_call": 117, "format": 118, "ext": 119, "ve": 120, "already": 121, "configured": 122, "cmakelists": 123, "txt": 124, "extension": 125, "exit": 126, "early": 127, "did_config": 128, "select": 129, "build": 130, "note": 131, "optimization": 132, "level": 133, "debug": 134, "default_cfg": 135, "relwithdebinfo": 136, "cfg": 137, "cmake_build_type": 138, "cmake_args": 139, "dcmake_build_type": 140, "dvllm_target_device": 141, "vllm_target_device": 142, "verbose": 143, "dcmake_verbose_makefile": 144, "dcmake_c_compiler_launcher": 145, "dcmake_cxx_compiler_launcher": 146, "dcmake_cuda_compiler_launcher": 147, "dcmake_hip_compiler_launcher": 148, "elif": 149, "pass": 150, "python": 151, "executable": 152, "cmake": 153, "can": 154, "find": 155, "exact": 156, "match": 157, "dvllm_python_executable": 158, "reuse": 159, "dependencies": 160, "subsequent": 161, "dvllm_python_path": 162, "check_output": 163, "exists": 164, "makedirs": 165, "removeprefix": 166, "append": 167, "absolute": 168, "range": 169, "runtimeerror": 170, "target_name": 171, "count": 172, "get_ext_fullpath": 173, "ensure": 174, "present": 175, "working": 176, "subprocess": 177, "oserror": 178, "raise": 179, "cannot": 180, "create": 181, "directory": 182, "does": 183, "exist": 184, "build_temp": 185, "targets": 186, "vllm_flash_attn": 187, "all": 188, "extensions": 189, "build_args": 190, "target": 191, "cwd": 192, "install": 193, "libraries": 194, "proper": 195, "location": 196, "outdir": 197, "skip": 198, "same": 199, "continue": 200, "appends": 201, "prefix": 202, "contains": 203, "need": 204, "remove": 205, "should": 206, "actually": 207, "nested_function": 208, "glob": 209, "print": 210, "copy_file": 211, "dirname": 212, "split": 213, "first": 214, "standard": 215, "build_ext": 216, "command": 217, "compile": 218, "copy": 219, "build_lib": 220, "current": 221, "included": 222, "editable": 223, "files": 224, "recursive": 225, "dst_file": 226, "copying": 227, "exist_ok": 228, "precompiled_build_ext": 229, "assert": 230, "vllm_use_precompiled": 231, "only": 232, "supported": 233, "cuda": 234, "builds": 235, "skipping": 236, "precompiled": 237, "precompiled_wheel_utils": 238, "extract_precompiled_and_patch_package": 239, "get_base_commit_in_main_branch": 240, "isfile": 241, "mkdtemp": 242, "urlretrieve": 243, "zipfile": 244, "list": 245, "rmtree": 246, "filter": 247, "replace": 248, "open": 249, "copyfileobj": 250, "basename": 251, "setdefault": 252, "wheel_url_or_path": 253, "dict": 254, "tempfile": 255, "temp_dir": 256, "wheel_filename": 257, "wheels": 258, "wheel_path": 259, "downloading": 260, "wheel": 261, "filename": 262, "existing": 263, "package_data_patch": 264, "files_to_copy": 265, "_c": 266, "abi3": 267, "_moe_c": 268, "_flashmla_c": 269, "_vllm_fa2_c": 270, "_vllm_fa3_c": 271, "cumem_allocator": 272, "compiled_regex": 273, "re": 274, "file_members": 275, "lambda": 276, "filelist": 277, "fil": 278, "decode": 279, "strip": 280, "loads": 281, "valueerror": 282, "warning": 283, "force": 284, "use": 285, "nightly": 286, "mainly": 287, "used": 288, "ci": 289, "testing": 290, "vllm_test_use_precompiled_nightly_wheel": 291, "latest": 292, "commit": 293, "hash": 294, "upstream": 295, "main": 296, "branch": 297, "resp_json": 298, "curl": 299, "https": 300, "api": 301, "github": 302, "com": 303, "repos": 304, "project": 305, "commits": 306, "utf": 307, "upstream_main_commit": 308, "json": 309, "sha": 310, "docker": 311, "context": 312, "git": 313, "may": 314, "immutable": 315, "missing": 316, "vllm_docker_build_context": 317, "check": 318, "local": 319, "repo": 320, "cat": 321, "calledprocesserror": 322, "fetch": 323, "remote": 324, "repository": 325, "update": 326, "any": 327, "branches": 328, "ensures": 329, "ref": 330, "its": 331, "history": 332, "our": 333, "current_branch": 334, "show": 335, "base_commit": 336, "merge": 337, "base": 338, "_no_device": 339, "empty": 340, "_is_neuron": 341, "_is_tpu": 342, "has_cuda": 343, "torch": 344, "_is_hip": 345, "rocm": 346, "hip": 347, "neuron": 348, "tpu": 349, "_is_cpu": 350, "cpu": 351, "_is_xpu": 352, "xpu": 353, "_build_custom_ops": 354, "get_rocm_version": 355, "cdll": 356, "c_uint32": 357, "is_file": 358, "pointer": 359, "get_rocm_core_version": 360, "byref": 361, "rocm_home": 362, "bin": 363, "librocm": 364, "core": 365, "see": 366, "blob": 367, "d11f5c20d500f729c393680a01fa902ebf92094b": 368, "rocm_version": 369, "cpp": 370, "l21": 371, "librocm_core_file": 372, "lib": 373, "librocm_core": 374, "ctypes": 375, "vererrors": 376, "getrocmversion": 377, "restype": 378, "argtypes": 379, "major": 380, "minor": 381, "patch": 382, "get_neuronxcc_version": 383, "search": 384, "get_paths": 385, "read": 386, "group": 387, "sysconfig": 388, "site_dir": 389, "purelib": 390, "version_file": 391, "neuronxcc": 392, "executed": 393, "successfully": 394, "fp": 395, "content": 396, "extract": 397, "regular": 398, "expression": 399, "__version__": 400, "string": 401, "could": 402, "output": 403, "parse": 404, "index": 405, "adapted": 406, "nvidia": 407, "apex": 408, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 409, "cuda_home": 410, "nvcc_output": 411, "universal_newlines": 412, "release_idx": 413, "release": 414, "nvcc_cuda_version": 415, "get_gaudi_sw_version": 416, "returns": 417, "driver": 418, "enable": 419, "console": 420, "printing": 421, "hl": 422, "smi": 423, "shell": 424, "text": 425, "capture_output": 426, "env": 427, "enable_console": 428, "returncode": 429, "stdout": 430, "get_vllm_version": 431, "get_version": 432, "write_to": 433, "_version": 434, "sep": 435, "dev": 436, "versions": 437, "might": 438, "contain": 439, "cuda_version": 440, "main_cuda_version": 441, "cuda_version_str": 442, "source": 443, "tarball": 444, "required": 445, "pypi": 446, "sdist": 447, "argv": 448, "cu": 449, "neuron_version": 450, "neuron_version_str": 451, "unknown": 452, "runtime": 453, "get_requirements": 454, "_read_requirements": 455, "startswith": 456, "package": 457, "requirements": 458, "requirements_dir": 459, "root_dir": 460, "resolved_requirements": 461, "line": 462, "common": 463, "cuda_major": 464, "cuda_minor": 465, "modified_requirements": 466, "req": 467, "flash": 468, "attn": 469, "12": 470, "built": 471, "other": 472, "unsupported": 473, "platform": 474, "find_cuda_init": 475, "extract_stack": 476, "_lazy_init": 477, "fn": 478, "format_list": 479, "callable": 480, "object": 481, "helper": 482, "initialization": 483, "errors": 484, "initializes": 485, "prints": 486, "stack": 487, "trace": 488, "how": 489, "happens": 490, "wrapper": 491, "nonlocal": 492, "traceback": 493, "initialized": 494, "tests": 495, "test_scalartype": 496, "test_scalar_type_min_max": 497, "parametrize": 498, "min": 499, "finfo": 500, "iinfo": 501, "type_tuple": 502, "torch_type": 503, "is_floating_point": 504, "utils": 505, "_nvml": 506, "amdsmi_init": 507, "amdsmi_shut_down": 508, "yield": 509, "finally": 510, "nvmlinit": 511, "nvmlshutdown": 512, "remoteopenaiserver": 513, "_start_server": 514, "__enter__": 515, "__exit__": 516, "_poll": 517, "_wait_for_server": 518, "url_root": 519, "url_for": 520, "get_client": 521, "get_async_client": 522, "popen": 523, "model": 524, "vllm_serve_args": 525, "env_dict": 526, "optional": 527, "subclasses": 528, "override": 529, "customize": 530, "server": 531, "process": 532, "launch": 533, "environ": 534, "initialize": 535, "safe": 536, "spawn": 537, "vllm_worker_multiproc_method": 538, "proc": 539, "serve": 540, "stderr": 541, "flexibleargumentparser": 542, "add_subparsers": 543, "subparser_init": 544, "parse_args": 545, "isdir": 546, "from_cli_args": 547, "create_model_config": 548, "create_load_config": 549, "get_model_loader": 550, "download_model": 551, "servesubcommand": 552, "get_open_port": 553, "seed": 554, "auto_port": 555, "max_wait_seconds": 556, "float": 557, "port": 558, "you": 559, "have": 560, "manually": 561, "specified": 562, "unix": 563, "sockets": 564, "uds": 565, "don": 566, "mutate": 567, "input": 568, "args": 569, "parser": 570, "description": 571, "openai": 572, "subparsers": 573, "dest": 574, "subparser": 575, "host": 576, "ar": 577, "terminate": 578, "wait": 579, "kill": 580, "exc_type": 581, "exc_value": 582, "timeoutexpired": 583, "needed": 584, "poll": 585, "polling": 586, "time": 587, "client": 588, "httptransport": 589, "sleep": 590, "timeout": 591, "health": 592, "start": 593, "httpx": 594, "transport": 595, "requests": 596, "while": 597, "status_code": 598, "break": 599, "raised": 600, "means": 601, "ready": 602, "yet": 603, "useful": 604, "suppress": 605, "result": 606, "exited": 607, "unexpectedly": 608, "failed": 609, "http": 610, "parts": 611, "kwargs": 612, "600": 613, "base_url": 614, "v1": 615, "api_key": 616, "dummy_api_key": 617, "max_retries": 618, "asyncopenai": 619, "remoteopenaiservercustom": 620, "child_process_fxn": 621, "ignore": 622, "assignment": 623, "store": 624, "custom": 625, "child": 626, "invoke": 627, "superclass": 628, "constructor": 629, "indirectly": 630, "exitcode": 631, "is_alive": 632, "_test_completion": 633, "prompt": 634, "token_ids": 635, "results": 636, "test": 637, "completion": 638, "completions": 639, "max_tokens": 640, "temperature": 641, "single_completion": 642, "choices": 643, "finish_reason": 644, "usage": 645, "token": 646, "ids": 647, "seeded": 648, "random": 649, "sampling": 650, "33": 651, "seeded_sampling": 652, "multiple": 653, "prompts": 654, "_test_completion_close": 655, "round": 656, "items": 657, "logprobs": 658, "top_logprobs": 659, "completion_close": 660, "_test_chat": 661, "messages": 662, "role": 663, "user": 664, "chat_response": 665, "chat": 666, "message": 667, "_test_embeddings": 668, "embeddings": 669, "encoding_format": 670, "single_embedding": 671, "embedding": 672, "_test_image_text": 673, "model_name": 674, "image_url": 675, "pure": 676, "do": 677, "feel": 678, "today": 679, "chat_completion": 680, "logprob": 681, "pure_text": 682, "what": 683, "image": 684, "compare_two_settings": 685, "compare_all_settings": 686, "arg1": 687, "arg2": 688, "env1": 689, "env2": 690, "generate": 691, "two": 692, "different": 693, "sets": 694, "arguments": 695, "environments": 696, "compare": 697, "second": 698, "variables": 699, "get_tokenizer": 700, "enumerate": 701, "tokenizer": 702, "zip": 703, "deepcopy": 704, "cosine_similarity": 705, "tensor": 706, "all_args": 707, "all_envs": 708, "several": 709, "argument": 710, "lists": 711, "dictionaries": 712, "trust_remote_code": 713, "trust": 714, "code": 715, "tokenizer_mode": 716, "auto": 717, "mode": 718, "can_force_load_format": 719, "load": 720, "hello": 721, "my": 722, "input_ids": 723, "ref_results": 724, "comparing": 725, "usually": 726, "real": 727, "weights": 728, "init_test_distributed_environment": 729, "init_distributed_environment": 730, "ensure_model_parallel_initialized": 731, "tp_size": 732, "pp_size": 733, "rank": 734, "distributed_init_port": 735, "local_rank": 736, "distributed_init_method": 737, "tcp": 738, "localhost": 739, "world_size": 740, "multi_process_parallel": 741, "init": 742, "shutdown": 743, "monkeypatch": 744, "pytest": 745, "test_target": 746, "ray": 747, "helps": 748, "debugging": 749, "compared": 750, "multiprocessing": 751, "working_dir": 752, "distributed": 753, "otherwise": 754, "workers": 755, "gitignore": 756, "excluding": 757, "move": 758, "dir": 759, "add": 760, "some": 761, "large": 762, "directories": 763, "ray_runtime_env_ignore_gitignore": 764, "runtime_env": 765, "vllm_path": 766, "excludes": 767, "shellcheck": 768, "dist": 769, "refs": 770, "error_on_warning": 771, "catch_warnings": 772, "filterwarnings": 773, "category": 774, "within": 775, "scope": 776, "manager": 777, "fail": 778, "given": 779, "emitted": 780, "warnings": 781, "get_physical_device_indices": 782, "devices": 783, "visible_devices": 784, "cuda_visible_devices": 785, "visible_indices": 786, "index_mapping": 787, "physical": 788, "wait_for_gpu_memory_to_clear": 789, "is_rocm": 790, "amdsmi_get_gpu_vram_usage": 791, "nvmldevicegethandlebyindex": 792, "nvmldevicegetmemoryinfo": 793, "is_free": 794, "amdsmi_get_processor_handles": 795, "values": 796, "threshold_bytes": 797, "threshold_ratio": 798, "timeout_s": 799, "120": 800, "nvml": 801, "instead": 802, "pytorch": 803, "measurement": 804, "start_time": 805, "output_raw": 806, "tuple": 807, "device": 808, "current_platform": 809, "dev_handle": 810, "mem_info": 811, "gb_used": 812, "vram_used": 813, "gb_total": 814, "vram_total": 815, "30": 816, "total": 817, "02f": 818, "gpu": 819, "memory": 820, "gib": 821, "end": 822, "threshold": 823, "threshold_by": 824, "fork_new_process_for_each_test": 825, "wraps": 826, "setpgrp": 827, "fork": 828, "getpgid": 829, "waitpid": 830, "signal": 831, "killpg": 832, "_exit": 833, "print_exc": 834, "_p": 835, "decorator": 836, "new": 837, "each": 838, "issues": 839, "7053": 840, "more": 841, "details": 842, "functools": 843, "make": 844, "leader": 845, "own": 846, "sending": 847, "sigterm": 848, "_pytest": 849, "outcomes": 850, "skipped": 851, "pid": 852, "convert": 853, "pgid": 854, "_pid": 855, "_exitcode": 856, "itself": 857, "old_signal_handler": 858, "sig_ign": 859, "processes": 860, "restore": 861, "handler": 862, "called": 863, "spawn_new_process_for_each_test": 864, "set_start_method": 865, "temporarydirectory": 866, "dumps": 867, "check_returncode": 868, "running_in_subprocess": 869, "just": 870, "directly": 871, "mp": 872, "__module__": 873, "tempdir": 874, "output_filepath": 875, "new_process": 876, "tmp": 877, "cloudpickle": 878, "allows": 879, "pickling": 880, "complex": 881, "functions": 882, "input_bytes": 883, "cmd": 884, "returned": 885, "successful": 886, "wrap": 887, "provide": 888, "information": 889, "create_new_process_for_each_test": 890, "is_xpu": 891, "literal": 892, "creates": 893, "runs": 894, "creation": 895, "defaults": 896, "platforms": 897, "separate": 898, "use_spawn": 899, "must": 900, "large_gpu_mark": 901, "skipif": 902, "is_cpu": 903, "warn": 904, "get_device_total_memory": 905, "min_gb": 906, "markdecorator": 907, "mark": 908, "skips": 909, "doesn": 910, "meet": 911, "minimum": 912, "requirement": 913, "gb": 914, "leveraged": 915, "via": 916, "large_gpu_test": 917, "without": 918, "enough": 919, "resources": 920, "filtering": 921, "memory_gb": 922, "gb_bytes": 923, "occurred": 924, "finding": 925, "stacklevel": 926, "reason": 927, "least": 928, "decorate": 929, "sufficient": 930, "currently": 931, "machine": 932, "uses": 933, "l4": 934, "has": 935, "24": 936, "vram": 937, "multi_gpu_marks": 938, "cuda_device_count_stateless": 939, "num_gpus": 940, "collection": 941, "marks": 942, "apply": 943, "multi_gpu_test": 944, "test_selector": 945, "test_skipif": 946, "gpus": 947, "reversed": 948, "func": 949, "completions_with_server_args": 950, "isinstance": 951, "gather": 952, "async": 953, "server_cli_args": 954, "num_logprobs": 955, "240": 956, "union": 957, "construct": 958, "obtain": 959, "spin": 960, "up": 961, "cli": 962, "starting": 963, "report": 964, "interval": 965, "bringing": 966, "default": 967, "240sec": 968, "one": 969, "max_token": 970, "instance": 971, "outputs": 972, "stream": 973, "max_tok": 974, "await": 975, "asyncio": 976, "co": 977, "get_client_text_generations": 978, "generated": 979, "tokens": 980, "made": 981, "ai": 982, "protocol": 983, "endpoint": 984, "get_client_text_logprob_generations": 985, "texttextlogprobs": 986, "operates": 987, "obtains": 988, "top": 989, "sequencegroup": 990, "text_generations": 991, "has_module_attribute": 992, "import_module": 993, "hasattr": 994, "attribute_name": 995, "specific": 996, "attribute": 997, "importerror": 998, "get_attn_backend_list_based_on_platform": 999, "is_cuda": 1000, "flash_attn_vllm_v1": 1001, "triton_attn_vllm_v1": 1002, "tree_attn": 1003, "attn_backend_list": 1004, "aiter": 1005, "noqa": 1006, "f401": 1007, "installed": 1008, "test_sequence": 1009, "sample_outputs": 1010, "completionsequencegroupoutput": 1011, "sequenceoutput": 1012, "samples": 1013, "parent_seq_id": 1014, "output_token": 1015, "prompt_logprobs": 1016, "sampler_output": 1017, "sampleroutput": 1018, "test_sampler_output_initialization": 1019, "sampled_token_probs": 1020, "sampled_token_ids": 1021, "test_sampler_output_getitem": 1022, "test_sampler_output_setitem": 1023, "new_output": 1024, "99": 1025, "test_sampler_output_len": 1026, "test_sampler_output_eq": 1027, "sampler_output1": 1028, "sampler_output2": 1029, "sampler_output3": 1030, "test_sequence_data_prefill": 1031, "from_seqs": 1032, "update_num_computed_tokens": 1033, "append_token_id": 1034, "reset_state_for_recompute": 1035, "get_num_uncomputed_tokens": 1036, "get_num_computed_tokens": 1037, "seq_data": 1038, "sequencedata": 1039, "advance": 1040, "reset": 1041, "simulating": 1042, "recompute": 1043, "test_sequence_group_stage": 1044, "create_dummy_prompt": 1045, "get_seqs": 1046, "is_prefill": 1047, "seq_group": 1048, "seqs": 1049, "seq": 1050, "test_vllm_port": 1051, "test_get_vllm_port_not_set": 1052, "get_vllm_port": 1053, "vllm_port": 1054, "clear": 1055, "test_get_vllm_port_valid": 1056, "valid": 1057, "integer": 1058, "5678": 1059, "test_get_vllm_port_invalid": 1060, "raises": 1061, "non": 1062, "abc": 1063, "test_get_vllm_port_uri": 1064, "uri": 1065, "appears": 1066, "test_routing_simulator": 1067, "is_available": 1068, "fixture": 1069, "appropriate": 1070, "test_basic_functionality": 1071, "get_available_strategies": 1072, "randn": 1073, "simulate_routing": 1074, "num_tokens": 1075, "hidden_size": 1076, "num_experts": 1077, "top_k": 1078, "basic": 1079, "functionality": 1080, "routing": 1081, "simulator": 1082, "strategy": 1083, "strategies": 1084, "routingsimulator": 1085, "hidden_states": 1086, "router_logits": 1087, "simulate": 1088, "topk_weights": 1089, "topk_ids": 1090, "strategy_name": 1091, "shapes": 1092, "shape": 1093, "wrong": 1094, "expert": 1095, "invalid": 1096, "id": 1097, "negative": 1098, "too": 1099, "test_routing_strategy_integration": 1100, "importorskip": 1101, "setenv": 1102, "select_experts": 1103, "works": 1104, "fusedmoe": 1105, "model_executor": 1106, "layers": 1107, "fused_moe": 1108, "layer": 1109, "parameters": 1110, "32": 1111, "16": 1112, "env_name": 1113, "vllm_moe_routing_simulation_strategy": 1114, "reload": 1115, "environment_variables": 1116, "use_grouped_topk": 1117, "renormalize": 1118, "indices_type": 1119, "long": 1120, "verify": 1121, "strate": 1122, "test_distribution_based_routing_with_custom_strategy": 1123, "distributionbasedrouting": 1124, "register_strategy": 1125, "registering": 1126, "register": 1127, "distribution": 1128, "based": 1129, "custom_strategy": 1130, "normal": 1131, "mean": 1132, "std": 1133, "custom_normal": 1134, "60": 1135, "48": 1136, "test_instance_compatibility": 1137, "static": 1138, "methods": 1139, "work": 1140, "correctly": 1141, "uniform_random": 1142, "test_sampling_params": 1143, "test_max_tokens_none": 1144, "samplingparams": 1145, "allowed": 1146, "01": 1147, "top_p": 1148, "model_config": 1149, "modelconfig": 1150, "dtype": 1151, "float16": 1152, "default_max_tokens": 1153, "4096": 1154, "test_sampling_params_from_request_with_no_guided_decoding_backend": 1155, "model_validate": 1156, "to_sampling_params": 1157, "guided_decoding_backend": 1158, "chatcompletionrequest": 1159, "response_format": 1160, "json_object": 1161, "sampling_params": 1162, "logits_processor_pattern": 1163, "expect": 1164, "backend": 1165, "engine": 1166, "guided_decoding": 1167, "test_sampling_params_from_request_with_guided_decoding_backend": 1168, "request_level_guided_decoding_backend": 1169, "expected": 1170, "identified": 1171, "resulting": 1172, "test_test": 1173, "test_logprobs": 1174, "llm": 1175, "check_num_logprobs": 1176, "sorted": 1177, "n_prompts": 1178, "settings": 1179, "requested": 1180, "ordered": 1181, "ascendingly": 1182, "expected_num": 1183, "step": 1184, "prev_logp": 1185, "order": 1186, "sorted_step": 1187, "key": 1188, "item": 1189, "watch": 1190, "out": 1191, "prob": 1192, "rankno": 1193, "tid": 1194, "logp": 1195, "enforce_eager": 1196, "max_num_seqs": 1197, "max_model_len": 1198, "128": 1199, "max_num_batched_tokens": 1200, "write": 1201, "short": 1202, "story": 1203, "about": 1204, "robot": 1205, "dreams": 1206, "greedy_sampling_params": 1207, "64": 1208, "regular_sampling_params": 1209, "topkp_sampling_params": 1210, "sp": 1211, "test_seed_behavior": 1212, "seed_everything": 1213, "randint": 1214, "42": 1215, "random_value_1": 1216, "100": 1217, "np_random_value_1": 1218, "np": 1219, "torch_random_value_1": 1220, "random_value_2": 1221, "np_random_value_2": 1222, "torch_random_value_2": 1223, "test_cache_block_hashing": 1224, "flatten_2d": 1225, "li": 1226, "lss": 1227, "ls": 1228, "test_auto_prefix_caching": 1229, "tokenizergroup": 1230, "lorarequest": 1231, "encode": 1232, "sequence": 1233, "token_inputs": 1234, "hash_of_block": 1235, "block_size": 1236, "concurrent_lora_int_ids": 1237, "tokenizer_id": 1238, "facebook": 1239, "opt": 1240, "125m": 1241, "enable_lora": 1242, "max_input_length": 1243, "hashes": 1244, "prefixes": 1245, "lora_int_id": 1246, "lora_request": 1247, "example_lora_": 1248, "example": 1249, "lora_": 1250, "sample_prompts": 1251, "seq_id": 1252, "prompt_token_ids": 1253, "inputs": 1254, "eos_token_id": 1255, "num_blocks": 1256, "idx": 1257, "blocks": 1258, "everywhere": 1259, "hash0": 1260, "hash1": 1261, "flatten_": 1262, "test_triton_utils": 1263, "test_triton_placeholder_is_module": 1264, "tritonplaceholder": 1265, "triton": 1266, "types": 1267, "moduletype": 1268, "__name__": 1269, "test_triton_language_placeholder_is_module": 1270, "tritonlanguageplaceholder": 1271, "triton_language": 1272, "language": 1273, "test_triton_placeholder_decorators": 1274, "foo": 1275, "bar": 1276, "baz": 1277, "jit": 1278, "autotune": 1279, "heuristics": 1280, "test_triton_placeholder_decorators_with_args": 1281, "configs": 1282, "1024": 1283, "test_triton_placeholder_language": 1284, "lang": 1285, "constexpr": 1286, "int64": 1287, "test_triton_placeholder_language_from_parent": 1288, "test_no_triton_fallback": 1289, "pop": 1290, "triton_utils": 1291, "importing": 1292, "mock": 1293, "being": 1294, "has_triton": 1295, "tl": 1296, "__class__": 1297, "test_embedded_commit": 1298, "test_embedded_commit_defined": 1299, "__version_tuple__": 1300, "test_config": 1301, "test_compile_config_repr_succeeds": 1302, "vllmconfig": 1303, "vllmbackend": 1304, "configure_post_pass": 1305, "repr": 1306, "mutates": 1307, "config": 1308, "succeeds": 1309, "val": 1310, "inductor_passes": 1311, "_testconfigfields": 1312, "test_get_field": 1313, "get_field": 1314, "field": 1315, "default_factory": 1316, "_testnestedconfig": 1317, "test_update_config": 1318, "update_config": 1319, "simple": 1320, "config1": 1321, "new_config1": 1322, "nonexistent": 1323, "assertionerror": 1324, "nested": 1325, "dataclass": 1326, "config2": 1327, "new_inner_config": 1328, "new_value": 1329, "new_config2": 1330, "config3": 1331, "new_config3": 1332, "test_auto_task": 1333, "model_id": 1334, "expected_runner_type": 1335, "expected_convert_type": 1336, "expected_task": 1337, "task": 1338, "runner_type": 1339, "convert_type": 1340, "supported_tasks": 1341, "test_score_task": 1342, "score": 1343, "test_transcription_task": 1344, "transcription": 1345, "test_auto_runner": 1346, "runner": 1347, "test_pooling_runner": 1348, "pooling": 1349, "test_draft_runner": 1350, "draft": 1351, "test_disable_sliding_window": 1352, "model_id_expected": 1353, "disable_sliding_window": 1354, "test_get_pooling_config": 1355, "_init_pooler_config": 1356, "sentence": 1357, "transformers": 1358, "minilm": 1359, "l12": 1360, "v2": 1361, "pooling_config": 1362, "normalize": 1363, "pooling_type": 1364, "poolingtype": 1365, "test_get_pooling_config_from_args": 1366, "poolerconfig": 1367, "asdict": 1368, "override_pooler_config": 1369, "cls": 1370, "test_default_pooling_type": 1371, "default_pooling_type": 1372, "_model_info": 1373, "pooler_config": 1374, "test_get_bert_tokenization_sentence_transformer_config": 1375, "_get_encoder_config": 1376, "baai": 1377, "bge": 1378, "en": 1379, "bge_model_config": 1380, "bert_bge_model_config": 1381, "max_seq_length": 1382, "512": 1383, "do_lower_case": 1384, "test_rope_customization": 1385, "getattr": 1386, "test_rope_scaling": 1387, "rope_type": 1388, "dynamic": 1389, "factor": 1390, "test_rope_theta": 1391, "16_000_000": 1392, "longchat_rope_scaling": 1393, "linear": 1394, "llama_model_config": 1395, "meta": 1396, "llama": 1397, "8b": 1398, "instruct": 1399, "hf_config": 1400, "rope_scaling": 1401, "rope_theta": 1402, "500_000": 1403, "8192": 1404, "hf_overrides": 1405, "16384": 1406, "longchat_model_config": 1407, "lmsys": 1408, "longchat": 1409, "13b": 1410, "16k": 1411, "entries": 1412, "test_is_encoder_decoder": 1413, "is_encoder_decoder": 1414, "test_uses_mrope": 1415, "uses_mrope": 1416, "test_generation_config_loading": 1417, "get_diff_sampling_param": 1418, "qwen": 1419, "qwen2": 1420, "5b": 1421, "generation_config": 1422, "generation": 1423, "loaded": 1424, "correct_generation_config": 1425, "repetition_penalty": 1426, "20": 1427, "overridden": 1428, "override_generation_config": 1429, "override_result": 1430, "test_load_config_pt_load_map_location": 1431, "loadconfig": 1432, "pt_load_map_location": 1433, "load_config": 1434, "test_get_and_verify_max_len": 1435, "get_and_verify_max_len": 1436, "expected_max_len": 1437, "should_raise": 1438, "configurations": 1439, "actual_max_len": 1440, "test_version": 1441, "test_version_is_defined": 1442, "test_version_tuple": 1443, "test_prev_minor_version_was": 1444, "_prev_minor_version_was": 1445, "version_tuple": 1446, "version_str": 1447, "test_logger": 1448, "f1": 1449, "f2": 1450, "test_trace_function_call": 1451, "mkstemp": 1452, "enable_trace_function_call": 1453, "settrace": 1454, "fd": 1455, "cur_dir": 1456, "__file__": 1457, "test_default_vllm_root_logger_configuration": 1458, "getlogger": 1459, "presumes": 1460, "vllm_configure_logging": 1461, "vllm_logging_config_path": 1462, "behavior": 1463, "activated": 1464, "logging": 1465, "propagate": 1466, "handlers": 1467, "streamhandler": 1468, "formatter": 1469, "newlineformatter": 1470, "_fmt": 1471, "_format": 1472, "datefmt": 1473, "_date_format": 1474, "test_descendent_loggers_depend_on_and_propagate_logs_to_root_logger": 1475, "init_logger": 1476, "assert_called_once": 1477, "uuid4": 1478, "root_logger": 1479, "root_handler": 1480, "unique_name": 1481, "notset": 1482, "world": 1483, "emit": 1484, "root_handle_mock": 1485, "call_args": 1486, "mock_calls": 1487, "log_record": 1488, "msg": 1489, "levelno": 1490, "test_logger_configuring_can_be_disabled": 1491, "assert_not_called": 1492, "_configure_vllm_root_logger": 1493, "again": 1494, "however": 1495, "mocks": 1496, "changes": 1497, "configuration": 1498, "occur": 1499, "dictconfig": 1500, "dict_config_mock": 1501, "test_an_error_is_raised_when_custom_logging_config_file_does_not_exist": 1502, "fails": 1503, "before": 1504, "change": 1505, "occurs": 1506, "ex_info": 1507, "e721": 1508, "test_an_error_is_raised_when_custom_logging_config_is_invalid_json": 1509, "namedtemporaryfile": 1510, "flush": 1511, "encoding": 1512, "logging_config_file": 1513, "nloggers": 1514, "nversion": 1515, "jsondecodeerror": 1516, "expecting": 1517, "test_an_error_is_raised_when_custom_logging_config_is_unexpected_json": 1518, "unexpected_config": 1519, "got": 1520, "test_custom_logging_config_is_parsed_and_used_when_provided": 1521, "assert_called_with": 1522, "valid_logging_config": 1523, "loggers": 1524, "test_custom_logging_config_causes_an_error_if_configure_logging_is_off": 1525, "expected_message_snippet": 1526, "evaluated": 1527, "remember": 1528, "root": 1529, "assumed": 1530, "been": 1531, "though": 1532, "other_logger_name": 1533, "other_logger": 1534, "test_prepare_object_to_dump": 1535, "prepare_object_to_dump": 1536, "customclass": 1537, "str_obj": 1538, "list_obj": 1539, "dict_obj": 1540, "set_obj": 1541, "tuple_obj": 1542, "customenum": 1543, "enum": 1544, "test_request_logger_log_outputs": 1545, "magicmock": 1546, "requestlogger": 1547, "log_outputs": 1548, "capture": 1549, "log": 1550, "mock_logger": 1551, "entrypoints": 1552, "request_logger": 1553, "max_log_len": 1554, "request_id": 1555, "123": 1556, "output_token_ids": 1557, "stop": 1558, "is_streaming": 1559, "delta": 1560, "response": 1561, "test_request_logger_log_outputs_streaming_delta": 1562, "streaming": 1563, "456": 1564, "test_request_logger_log_outputs_streaming_complete": 1565, "complete": 1566, "789": 1567, "length": 1568, "test_request_logger_log_outputs_with_truncation": 1569, "respects": 1570, "setting": 1571, "truncation": 1572, "long_output": 1573, "very": 1574, "truncated": 1575, "long_token_ids": 1576, "truncate": 1577, "characters": 1578, "logged_output": 1579, "were": 1580, "logged_token_ids": 1581, "test_request_logger_log_outputs_none_values": 1582, "handles": 1583, "test_request_logger_log_outputs_empty_output": 1584, "test_request_logger_log_outputs_integration": 1585, "log_inputs": 1586, "alongside": 1587, "both": 1588, "interference": 1589, "integration": 1590, "prompt_embeds": 1591, "params": 1592, "twice": 1593, "once": 1594, "call_count": 1595, "correct": 1596, "patterns": 1597, "input_call": 1598, "call_args_list": 1599, "output_call": 1600, "received": 1601, "test_streaming_complete_logs_full_text_content": 1602, "includes": 1603, "full": 1604, "accumulated": 1605, "actual": 1606, "full_response": 1607, "streaming_complete": 1608, "logged": 1609, "test_outputs": 1610, "test_request_output_forward_compatible": 1611, "requestoutput": 1612, "test_request_id": 1613, "finished": 1614, "example_arg_added_in_new_version": 1615, "some_value": 1616, "test_pooling_params": 1617, "test_task": 1618, "poolingparams": 1619, "pooling_params": 1620, "test_embed": 1621, "embed": 1622, "invalid_parameters": 1623, "activation": 1624, "softmax": 1625, "test_embed_dimensions": 1626, "model_info": 1627, "embedmodelinfo": 1628, "dimensions": 1629, "is_matryoshka": 1630, "matryoshka_dimensions": 1631, "test_classify": 1632, "test_encode": 1633, "test_regression": 1634, "test_duplicated_ignored_sequence_group": 1635, "1655": 1636, "256": 1637, "distilbert": 1638, "distilgpt2": 1639, "tensor_parallel_size": 1640, "1000": 1641, "say": 1642, "test_gc": 1643, "collect": 1644, "empty_cache": 1645, "memory_allocated": 1646, "del": 1647, "gc": 1648, "allocated": 1649, "kv": 1650, "cache": 1651, "released": 1652, "others": 1653, "less": 1654, "than": 1655, "50mb": 1656, "around": 1657, "10mb": 1658, "50": 1659, "test_model_from_modelscope": 1660, "modelscope": 1661, "cn": 1662, "models": 1663, "qwen1": 1664, "vllm_use_modelscope": 1665, "hf_token": 1666, "400": 1667, "bad": 1668, "president": 1669, "united": 1670, "states": 1671, "capital": 1672, "france": 1673, "future": 1674, "95": 1675, "conftest": 1676, "_read_prompts": 1677, "readlines": 1678, "imageassetprompts": 1679, "imagetestassets": 1680, "imageasset": 1681, "stop_sign": 1682, "cherry_blossom": 1683, "convenience": 1684, "define": 1685, "matches": 1686, "assets": 1687, "iterating": 1688, "through": 1689, "videoassetprompts": 1690, "videotestassets": 1691, "videoasset": 1692, "baby_reading": 1693, "audioassetprompts": 1694, "audiotestassets": 1695, "audioasset": 1696, "mary_had_lamb": 1697, "winning_call": 1698, "cleanup_vllm_use_v1": 1699, "delenv": 1700, "oracle": 1701, "vllm_use_v1": 1702, "during": 1703, "loading": 1704, "invocation": 1705, "touch": 1706, "cleaned": 1707, "every": 1708, "delete": 1709, "cause": 1710, "clean": 1711, "upon": 1712, "modifies": 1713, "run_with_both_engines": 1714, "get_closest_marker": 1715, "automatically": 1716, "use_v1": 1717, "param": 1718, "decorated": 1719, "skip_v1": 1720, "skip_v0": 1721, "node": 1722, "v0": 1723, "init_test_http_connection": 1724, "pytest_asyncio": 1725, "event": 1726, "loop": 1727, "per": 1728, "sure": 1729, "created": 1730, "anew": 1731, "global_http_connection": 1732, "reuse_client": 1733, "dist_init": 1734, "initialize_model_parallel": 1735, "cleanup_dist_env_and_memory": 1736, "temp_file": 1737, "nccl": 1738, "should_do_global_cleanup_after_test": 1739, "allow": 1740, "subdirectories": 1741, "global": 1742, "cleanup": 1743, "overriding": 1744, "10x": 1745, "speedup": 1746, "unit": 1747, "since": 1748, "skip_global_cleanup": 1749, "cleanup_fixture": 1750, "dynamo_reset": 1751, "_dynamo": 1752, "example_prompts": 1753, "_test_prompts": 1754, "example_system_message": 1755, "_sys_msg": 1756, "decoderprompttype": 1757, "example_encoder_decoder_prompts": 1758, "zip_enc_dec_prompts": 1759, "explicitencoderdecoderprompt": 1760, "encoder": 1761, "decoder": 1762, "wherein": 1763, "pair": 1764, "corresponds": 1765, "reverse": 1766, "encoder_prompts": 1767, "custom_decoder_prompts": 1768, "empty_str_decoder_prompts": 1769, "none_decoder_prompts": 1770, "empty_str": 1771, "example_long_prompts": 1772, "_long_prompts": 1773, "image_assets": 1774, "video_assets": 1775, "audio_assets": 1776, "hfrunner": 1777, "get_default_device": 1778, "wrap_device": 1779, "get_inputs": 1780, "get_prompt_embeddings": 1781, "classify": 1782, "generate_greedy": 1783, "generate_beam_search": 1784, "generate_greedy_logprobs": 1785, "_hidden_states_to_seq_logprobs": 1786, "_hidden_states_to_logprobs": 1787, "generate_greedy_logprobs_limit": 1788, "generate_encoder_decoder_greedy_logprobs_limit": 1789, "predict": 1790, "device_type": 1791, "_t": 1792, "maybe_model_redirect": 1793, "from_pretrained": 1794, "_get_and_verify_dtype": 1795, "sentencetransformer": 1796, "crossencoder": 1797, "model_kwargs": 1798, "is_sentence_transformer": 1799, "is_cross_encoder": 1800, "skip_tokenizer_init": 1801, "auto_cls": 1802, "_baseautomodelclass": 1803, "automodelforcausallm": 1804, "autoconfig": 1805, "torch_dtype": 1806, "is_pooling_model": 1807, "lazy": 1808, "amd": 1809, "sentence_transformers": 1810, "automodel_args": 1811, "processor": 1812, "images": 1813, "promptimageinput": 1814, "videos": 1815, "promptvideoinput": 1816, "audios": 1817, "promptaudioinput": 1818, "batchfeature": 1819, "batchencoding": 1820, "all_inputs": 1821, "processor_kwargs": 1822, "return_tensors": 1823, "pt": 1824, "video": 1825, "audio_inputs": 1826, "hack": 1827, "processors": 1828, "take": 1829, "sampling_rate": 1830, "audio": 1831, "sr": 1832, "squeeze": 1833, "get_input_embeddings": 1834, "tolist": 1835, "final": 1836, "logits": 1837, "dim": 1838, "batch_decode": 1839, "output_ids": 1840, "use_cache": 1841, "output_str": 1842, "skip_special_tokens": 1843, "clean_up_tokenization_spaces": 1844, "do_sample": 1845, "max_new_tokens": 1846, "beam_width": 1847, "num_beams": 1848, "num_return_sequences": 1849, "pad_token_id": 1850, "all_logprobs": 1851, "output_hidden_states": 1852, "return_dict_in_generate": 1853, "seq_logprobs": 1854, "get_output_embeddings": 1855, "matmul": 1856, "log_softmax": 1857, "unsqueeze": 1858, "output_embeddings": 1859, "hidden_state": 1860, "last_hidden_states": 1861, "weight": 1862, "bias": 1863, "float32": 1864, "topk": 1865, "reshape": 1866, "output_len": 1867, "seq_logprobs_lst": 1868, "tok_idx": 1869, "tok_logprobs": 1870, "drop": 1871, "tok_logprobs_dct": 1872, "token_id": 1873, "indices": 1874, "tokenstextlogprobs": 1875, "all_output_ids": 1876, "all_output_strs": 1877, "seq_ids": 1878, "sequences": 1879, "output_logprobs": 1880, "outp": 1881, "to_enc_dec_tuple_list": 1882, "encoder_decoder_prompts": 1883, "greedy": 1884, "encoder_prompt": 1885, "decoder_prompt": 1886, "encoder_inputs": 1887, "decoder_input_ids": 1888, "decoder_inputs": 1889, "enco": 1890, "convert_to_tensor": 1891, "hf_runner": 1892, "vllmrunner": 1893, "_final_steps_generate_w_logprobs": 1894, "generate_w_logprobs": 1895, "generate_encoder_decoder_w_logprobs": 1896, "generate_encoder_decoder_greedy_logprobs": 1897, "reward": 1898, "apply_model": 1899, "runneroption": 1900, "convertoption": 1901, "tokenizer_name": 1902, "disable_log_stats": 1903, "enable_chunked_prefill": 1904, "swap_space": 1905, "textprompt": 1906, "multimodal": 1907, "multi_modal_data": 1908, "text_prompt_kwargs": 1909, "req_outputs": 1910, "req_output": 1911, "prompt_str": 1912, "prompt_ids": 1913, "req_sample_output_ids": 1914, "req_sample_output_strs": 1915, "sample": 1916, "tokenstextlogprobspromptlogprobs": 1917, "toks_str_logsprobs_prompt_logprobs": 1918, "omit": 1919, "greedy_params": 1920, "num_prompt_logprobs": 1921, "stop_token_ids": 1922, "greedy_logprobs_params": 1923, "beam_search": 1924, "beamsearchparams": 1925, "returned_outputs": 1926, "texts": 1927, "probs": 1928, "text_1": 1929, "text_2": 1930, "collective_rpc": 1931, "get_model": 1932, "nn": 1933, "_r": 1934, "llm_engine": 1935, "vllm_enable_v1_multiprocessing": 1936, "executor": 1937, "vllm_allow_insecure_serialization": 1938, "_apply_model": 1939, "vllm_runner": 1940, "temporary_enable_log_propagate": 1941, "caplog_vllm": 1942, "caplog": 1943, "temporarily": 1944, "because": 1945, "depends": 1946, "logs": 1947, "propagated": 1948, "num_gpus_available": 1949, "device_count": 1950, "initializing": 1951, "dummy_opt_path": 1952, "snapshot_download": 1953, "dump": 1954, "json_path": 1955, "_dummy_opt_path": 1956, "repo_id": 1957, "local_dir": 1958, "ignore_patterns": 1959, "h5": 1960, "msgpack": 1961, "architectures": 1962, "myoptforcausallm": 1963, "dummy_llava_path": 1964, "_dummy_llava_path": 1965, "llava": 1966, "hf": 1967, "7b": 1968, "myllava": 1969, "dummy_gemma2_embedding_path": 1970, "_dummy_gemma2_embedding_path": 1971, "multilingual": 1972, "gemma2": 1973, "mygemma2embedding": 1974, "pytest_addoption": 1975, "addoption": 1976, "action": 1977, "store_true": 1978, "help": 1979, "pytest_collection_modifyitems": 1980, "getoption": 1981, "add_marker": 1982, "skip_optional": 1983, "option": 1984, "keywords": 1985, "cli_config_file": 1986, "_test_dir": 1987, "yaml": 1988, "cli_config_file_with_model": 1989, "test_config_with_model": 1990, "test_sharded_state_loader": 1991, "test_filter_subtensors": 1992, "_filter_subtensors": 1993, "keys": 1994, "state_dict": 1995, "filtered_state_dict": 1996, "shardedstateloader": 1997, "equal": 1998, "nans": 1999, "llama_3p2_1b_files": 2000, "input_dir": 2001, "1b": 2002, "original": 2003, "_run_writer": 2004, "save_sharded_state": 2005, "listdir": 2006, "copytree": 2007, "fnmatch": 2008, "output_dir": 2009, "weights_patterns": 2010, "llm_sharded_writer": 2011, "worker": 2012, "metadata": 2013, "shutil": 2014, "_run_generate": 2015, "put": 2016, "close": 2017, "join_thread": 2018, "queue": 2019, "gen": 2020, "__dict__": 2021, "get_context": 2022, "parallelism": 2023, "safetensors": 2024, "gpu_memory_utilization": 2025, "ctx": 2026, "interface": 2027, "changed": 2028, "hang": 2029, "isolation": 2030, "distributed_executor_backend": 2031, "call": 2032, "prevent": 2033, "deadlock": 2034, "test_inputs": 2035, "test_parse_single_batch_empty": 2036, "parse_and_batch_prompt": 2037, "test_parse_single_batch_string_consistent": 2038, "string_input": 2039, "test_parse_single_batch_token_consistent": 2040, "token_input": 2041, "test_parse_single_batch_string_slice": 2042, "inputs_slice": 2043, "slice": 2044, "string_inputs": 2045, "test_zip_enc_dec_prompts": 2046, "mm_processor_kwargs": 2047, "expected_mm_kwargs": 2048, "zipping": 2049, "enc": 2050, "dec": 2051, "another": 2052, "decoder_prompts": 2053, "zipped_prompts": 2054, "exp_kwargs": 2055, "zipped": 2056, "samplingtype": 2057, "guideddecodingparams": 2058, "from_optional": 2059, "__post_init__": 2060, "model_json_schema": 2061, "basemodel": 2062, "regex": 2063, "choice": 2064, "grammar": 2065, "whitespace_pattern": 2066, "structural_tag": 2067, "arg": 2068, "schemas": 2069, "pydantic": 2070, "sum": 2071, "validate": 2072, "fields": 2073, "mutually": 2074, "exclusive": 2075, "guide_count": 2076, "kind": 2077, "guided": 2078, "decoding": 2079, "requestoutputkind": 2080, "_verify_args": 2081, "_verify_greedy_sampling": 2082, "update_from_generation_config": 2083, "update_from_tokenizer": 2084, "sampling_type": 2085, "all_stop_token_ids": 2086, "bad_words_token_ids": 2087, "clone": 2088, "__repr__": 2089, "best_of": 2090, "presence_penalty": 2091, "frequency_penalty": 2092, "min_p": 2093, "bad_words": 2094, "include_stop_str_in_output": 2095, "ignore_eos": 2096, "min_tokens": 2097, "detokenize": 2098, "spaces_between_special_tokens": 2099, "logits_processors": 2100, "logitsprocessor": 2101, "truncate_prompt_tokens": 2102, "annotated": 2103, "msgspec": 2104, "ge": 2105, "output_kind": 2106, "cumulative": 2107, "logit_bias": 2108, "allowed_token_ids": 2109, "extra_args": 2110, "clamp": 2111, "between": 2112, "samp": 2113, "deal": 2114, "_real_n": 2115, "greater": 2116, "_max_temp": 2117, "numerical": 2118, "nan": 2119, "inf": 2120, "tensors": 2121, "maxed": 2122, "hold": 2123, "evaluation": 2124, "until": 2125, "output_text_buffer_length": 2126, "typeerror": 2127, "zero": 2128, "quietly": 2129, "accept": 2130, "disabled": 2131, "prefer": 2132, "disable": 2133, "discard": 2134, "model_eos_token_id": 2135, "eos": 2136, "support": 2137, "processing": 2138, "_all_stop_token_ids": 2139, "eos_ids": 2140, "include": 2141, "primary": 2142, "handled": 2143, "separately": 2144, "stopping": 2145, "purposes": 2146, "lstrip": 2147, "anytokenizer": 2148, "_bad_words_token_ids": 2149, "bad_word": 2150, "prohibit": 2151, "words": 2152, "beginning": 2153, "middle": 2154, "related": 2155, "add_prefix_space": 2156, "parameter": 2157, "add_special_tokens": 2158, "space": 2159, "produces": 2160, "word": 2161, "invalid_token_ids": 2162, "max_token_id": 2163, "vocabulary": 2164, "size": 2165, "following": 2166, "integers": 2167, "satisfying": 2168, "_sampling_eps": 2169, "random_seed": 2170, "internal": 2171, "backward": 2172, "compatibility": 2173, "guaranteed": 2174, "deep": 2175, "maybe": 2176, "objects": 2177, "arbitrary": 2178, "nontrivial": 2179, "amount": 2180, "expensive": 2181, "copied": 2182, "needs": 2183, "parallel": 2184, "3087": 2185, "logit_processor_refs": 2186, "lp": 2187, "memo": 2188, "all_parameters": 2189, "valid_parameters": 2190, "_merge_default_parameters": 2191, "_set_default_parameters": 2192, "_verify_valid_parameters": 2193, "step_tag_id": 2194, "returned_token_ids": 2195, "poolingtask": 2196, "overwrite": 2197, "validation": 2198, "done": 2199, "against": 2200, "setattr": 2201, "served_model_name": 2202, "matryoshka": 2203, "representation": 2204, "changing": 2205, "lead": 2206, "poor": 2207, "mds": 2208, "supports": 2209, "requires_token_ids": 2210, "extra_kwargs": 2211, "final_only": 2212, "get_default_cache_root": 2213, "expanduser": 2214, "xdg_cache_home": 2215, "get_default_config_root": 2216, "xdg_config_home": 2217, "maybe_convert_int": 2218, "maybe_convert_bool": 2219, "urlparse": 2220, "suggest": 2221, "k8s": 2222, "service": 2223, "discovery": 2224, "issue": 2225, "err": 2226, "parsed": 2227, "scheme": 2228, "caused": 2229, "kubernetes": 2230, "docs": 2231, "stable": 2232, "serving": 2233, "env_vars": 2234, "html": 2235, "__getattr__": 2236, "__dir__": 2237, "is_set": 2238, "explicitly": 2239, "set_vllm_use_v1": 2240, "please": 2241, "compute_hash": 2242, "hexdigest": 2243, "md5": 2244, "whenever": 2245, "added": 2246, "factors": 2247, "affects": 2248, "computation": 2249, "graph": 2250, "vllm_pp_layer_partition": 2251, "graphs": 2252, "vars": 2253, "affect": 2254, "kernels": 2255, "attention": 2256, "backends": 2257, "also": 2258, "todo": 2259, "deftruth": 2260, "factorize": 2261, "environment_variables_to_hash": 2262, "vllm_mla_disable": 2263, "vllm_use_triton_flash_attn": 2264, "vllm_use_triton_awq": 2265, "vllm_dp_rank": 2266, "vllm_dp_size": 2267, "vllm_use_standalone_compile": 2268, "vllm_fused_moe_chunk_size": 2269, "vllm_flashinfer_moe_backend": 2270, "vllm_v1_use_prefill_decode_attention": 2271, "vllm_use_aiter_unified_attention": 2272, "vllm_attention_backend": 2273, "vllm_use_flashinfer_sampler": 2274, "vllm_flashinfer_force_tensor_cores": 2275, "vllm_disabled_kernels": 2276, "vllm_use_deep_gemm": 2277, "vllm_use_trtllm_fp4_gemm": 2278, "vllm_use_flashinfer_moe_fp8": 2279, "vllm_use_flashinfer_moe_fp4": 2280, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 2281, "vllm_use_flashinfer_moe_mxfp4_bf16": 2282, "vllm_use_cudnn_prefill": 2283, "vllm_use_trtllm_attention": 2284, "vllm_rocm_use_aiter": 2285, "vllm_rocm_use_aiter_paged_attn": 2286, "vllm_rocm_use_aiter_linear": 2287, "vllm_rocm_use_aiter_moe": 2288, "vllm_rocm_use_aiter_rmsnorm": 2289, "vllm_rocm_use_aiter_mla": 2290, "vllm_rocm_use_aiter_mha": 2291, "vllm_rocm_use_skinny_gemm": 2292, "vllm_rocm_fp8_padding": 2293, "_ipex_ops": 2294, "ipex_ops": 2295, "_reshape_activation_tensor": 2296, "silu_and_mul": 2297, "gelu_and_mul": 2298, "gelu_tanh_and_mul": 2299, "gelu_fast": 2300, "gelu_new": 2301, "gelu_quick": 2302, "paged_attention_v1": 2303, "paged_attention_v2": 2304, "rotary_embedding": 2305, "batched_rotary_embedding": 2306, "rms_norm": 2307, "fused_add_rms_norm": 2308, "varlen_attention": 2309, "reshape_and_cache": 2310, "reshape_and_cache_flash": 2311, "flash_attn_varlen_func": 2312, "get_scheduler_metadata": 2313, "copy_blocks": 2314, "swap_blocks": 2315, "chunk": 2316, "num": 2317, "x1": 2318, "x2": 2319, "chunks": 2320, "ipex": 2321, "functional": 2322, "gelu": 2323, "single_query_kv_attention": 2324, "contiguous": 2325, "view_as": 2326, "query": 2327, "key_cache": 2328, "value_cache": 2329, "num_kv_heads": 2330, "scale": 2331, "block_tables": 2332, "context_lens": 2333, "max_context_len": 2334, "alibi_slopes": 2335, "kv_cache_dtype": 2336, "k_scale": 2337, "v_scale": 2338, "tp_rank": 2339, "blocksparse_local_blocks": 2340, "blocksparse_vert_stride": 2341, "blocksparse_block_size": 2342, "blocksparse_head_sliding_step": 2343, "num_heads": 2344, "num_queries_per_tokens": 2345, "pagedattention": 2346, "exp_sum": 2347, "max_logits": 2348, "tmp_out": 2349, "rotary_embedding_batched": 2350, "positions": 2351, "batch_size": 2352, "seq_len": 2353, "head_size": 2354, "cos_sin_cache": 2355, "cos_sin_dim": 2356, "rot_dim": 2357, "is_neox": 2358, "cos_sin_cache_offsets": 2359, "epsilon": 2360, "add_rms_norm": 2361, "copy_": 2362, "residual": 2363, "endswith": 2364, "seqlen_q": 2365, "seqlen_k": 2366, "max_seqlen_q": 2367, "max_seqlen_k": 2368, "pdropout": 2369, "softmax_scale": 2370, "zero_tensors": 2371, "is_causal": 2372, "return_softmax": 2373, "gen_": 2374, "generator": 2375, "window_size_left": 2376, "window_size_right": 2377, "logits_soft_cap": 2378, "slot_mapping": 2379, "k_scale_float": 2380, "v_scale_float": 2381, "fp8": 2382, "cumsum": 2383, "cu_seqlens_q": 2384, "seqused_k": 2385, "kernel": 2386, "causal": 2387, "block_table": 2388, "window_size": 2389, "softcap": 2390, "cu_seqlens_k": 2391, "keep": 2392, "compatible": 2393, "scheduler_metadata": 2394, "fa_version": 2395, "q_descale": 2396, "k_descale": 2397, "v_descale": 2398, "num_splits": 2399, "s_aux": 2400, "int32": 2401, "real_window_size": 2402, "warning_once": 2403, "num_heads_q": 2404, "num_heads_kv": 2405, "headdim": 2406, "cache_seqlens": 2407, "qkv_dtype": 2408, "bfloat16": 2409, "headdim_v": 2410, "cu_seqlens_k_new": 2411, "cache_leftpad": 2412, "page_size": 2413, "max_seqlen_k_new": 2414, "infinite": 2415, "window": 2416, "has_softcap": 2417, "tuned": 2418, "speed": 2419, "pack_gqa": 2420, "sm_margin": 2421, "sms": 2422, "communication": 2423, "implemented": 2424, "returning": 2425, "key_caches": 2426, "value_caches": 2427, "block_mapping": 2428, "src": 2429, "dst": 2430, "beamsearchsequence": 2431, "beamsearchoutput": 2432, "beamsearchinstance": 2433, "prompt_tokens": 2434, "beams": 2435, "completed": 2436, "get_beam_search_score": 2437, "cumulative_logprob": 2438, "length_penalty": 2439, "calculate": 2440, "beam": 2441, "penalty": 2442, "huggingface": 2443, "ccb92be23def445f2afdea94c31286f84b89eb5b": 2444, "l938": 2445, "create_sort_beams_key_function": 2446, "sort_beams_key": 2447, "cum_logprob": 2448, "typing": 2449, "module_attrs": 2450, "attr_name": 2451, "__package__": 2452, "whether": 2453, "previous": 2454, "supplied": 2455, "hidden": 2456, "metrics": 2457, "anything": 2458, "tree": 2459, "won": 2460, "right": 